# setup tools
brew "stow"
brew "duti"

# cli tools
brew "fzf"
brew "ripgrep"
brew "wget"
brew "jq"
brew "mdcat"

# aws 
brew "awscli"
tap "tekumara/tap"
brew "awsweb"

# dev tools
brew "shellcheck"
cask "beyond-compare"
# for vscode symbol generation
brew "ctags"

# compared to docker, kubernetes-cli includes a newer version of kubectl, man pages & completions 
brew "kubernetes-cli"
cask "docker"

# handy kubernetes tools
brew "kubectx"
brew "k9s"

# python
brew "pyenv"
brew "pyenv-virtualenvwrapper"

# needed for building some python packages
brew "automake"
brew "libtool"

# java
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
tap "coursier/formulas"
brew "coursier/formulas/coursier"

# golang
brew "go"

# install mac apps
cask "visual-studio-code"
cask "macbreakz"
cask "dropbox"
cask "spotify"
cask "go2shell"
cask "intellij-idea-ce"
cask "firefox"
cask "authy"
cask "iterm2"
cask "google-backup-and-sync"
cask "calibre"
cask "vlc" unless system "[[ -d '/Applications/VLC.app' ]]"
cask "google-chrome" unless system "[[ -d '/Applications/Google Chrome.app' ]]"
cask "slack" unless system "[[ -d '/Applications/Slack.app' ]]"  