# setup tools
brew "stow"
brew "duti"
brew "antibody"

# cli tools
brew "fzf"
brew "ripgrep"
brew "wget"
brew "jq"
brew "mdcat"
brew "scmpuff"
brew "gh"
brew "zoxide"
brew "diff-so-fancy"

# aws
brew "awscli"
cask "session-manager-plugin", args: {'no-quarantine': true}
cask "aws-vault"
brew "cfn-lint"

# dev tools
brew "shellcheck"
cask "intellij-idea-ce"
cask "visual-studio-code"
cask "beyond-compare"
# for vscode symbol generation
brew "ctags"
brew "nbdime"
tap "jabley/homebrew-wrk2"
# don't install on m1 mac because of https://github.com/giltene/wrk2/issues/120
brew "wrk2", args: ["HEAD"] unless system '[[ "$(/usr/bin/uname -m)" == "arm64" ]]'
brew "terraform"

brew "pandoc"
# later version than apple git
brew "git"
brew "git-lfs"

cask "docker"
brew "hadolint"

# handy kubernetes tools
brew "kubectx"
brew "k9s"
brew "helm"
brew "k3d"

# python
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "pipx"

# needed for building some python packages
brew "automake"
brew "libtool"

# node
brew "node"
brew "yarn"
brew "Schniz/tap/fnm"

# java
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk11"
brew "coursier/formulas/coursier"

# golang
brew "go"
brew "staticcheck"
brew "goreleaser/tap/goreleaser"

# install mac apps
cask "authy"
cask "calibre"
cask "dropbox"
cask "firefox"
# run go2shell manually after first install to add to Finder
cask "go2shell"
cask "google-drive"
cask "google-chrome" unless system "[[ -d '/Applications/Google Chrome.app' ]]"
cask "iterm2"
cask "licecap"
cask "macbreakz"
cask "slack" unless system "[[ -d '/Applications/Slack.app' ]]"
cask "spotify"
cask "vlc"
cask "whatsapp"
